---
kind: type
id: T:Autodesk.Revit.DB.TextAlignFlags
source: html/ccbdb8fc-32c2-c781-184d-4d8ee8fe55db.htm
---
# Autodesk.Revit.DB.TextAlignFlags

An enumerated type listing all the Text align flags.

## Syntax (C#)
```csharp
public enum TextAlignFlags
```